In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [3]:
s=pd.Series(['Shahad','Sarah','Muna'],index=[1,2,3])
s

1    Shahad
2     Sarah
3      Muna
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [5]:
s.index=[11,12,13]
s

11    Shahad
12     Sarah
13      Muna
dtype: object

## Q3: Retrieve First and second elements.

In [6]:
s[0:2]

11    Shahad
12     Sarah
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [9]:
dic={11:'Shahad'}
s2=pd.Series(dic)
s=s.append(s2)
s

11    Shahad
12     Sarah
13      Muna
11    Shahad
dtype: object

In [13]:
s.drop_duplicates(inplace=True)
s

11    Shahad
12     Sarah
13      Muna
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [16]:
df=pd.DataFrame({'ID':[], 'Name':[]})
df

Empty DataFrame
Columns: [ID, Name]
Index: []

## Q6: Read educ_figdp_1_Data.csv file

In [18]:
df=pd.read_csv('educ_figdp_1_Data.csv')
df.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [22]:
# loc enable label selection

df.loc[df.TIME==2000].count()

TIME                  32
GEO                   32
INDIC_ED              32
Value                 32
Flag and Footnotes    12
dtype: int64

In [27]:
df.loc[0:5,['INDIC_ED','Value','Flag and Footnotes']]

                                            INDIC_ED Value Flag and Footnotes
0  Total public expenditure on education as % of ...     :                NaN
1  Total public expenditure on education as % of ...     :                NaN
2  Total public expenditure on education as % of ...  5.00                  e
3  Total public expenditure on education as % of ...  5.03                  e
4  Total public expenditure on education as % of ...  4.95                  e
5  Total public expenditure on education as % of ...  4.92                  e

In [29]:
#slicing enabels the selections by index

df[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [33]:
df[0:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [37]:
df.iloc[0:5,:2:]

   TIME                            GEO
0  2000  European Union (28 countries)
1  2001  European Union (28 countries)
2  2002  European Union (28 countries)
3  2003  European Union (28 countries)
4  2004  European Union (28 countries)